Revit 2020 API
SchemaCommon.Thumbnail Property
 The property labeled "Thumbnail" from the "PrismTransparent" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static string Thumbnail { get; }
Visual Basic
Public Shared ReadOnly Property Thumbnail As String
	Get
Visual C++
public:
static property String^ Thumbnail {
	String^ get ();
}
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyString".
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace